# print() არის ფუნქცია
print("გამარჯობა სამყარო")


# ფუნქციას ყოველთვის აქვს გამხსნელი და დამხურავი ფრჩხილები ()

# print() დანიშნულება არის რომ ტერმინალში გამოიტანოს მნიშვნელობა

# parentheses -ფრჩხილები
# data types / მონაცემთა ტიპები 16-14 მონაცემთა ტიპი

# ტექსტსტულარუი მონაცემები / string -- ბრჭყალებში მოთავსებული ტექსტი '' --- ""
# ციფრული მონაცემები integer, float, ------------ imaginary number

# int ---1, 3 ,4,5,6,7,8,9,10,11,12 -- მთელი რიცხვები
# float --- 1.4, 1.5 , 111.667, ათწილადი

# imaginary number -- 3 + 5j
# string vs numeric numbers ---str არ ემატება numeric numbers

# print("გოას" + 12.2) არ შეიძლება ❌

print(3 + 5)
print(3 + 5.5)


# ცვლადი -- variable
# ცვლადები ინახავენ მნიშვნელობებს


Box= "glasses"
numbers = 1
sentence = 'დათვი ჭამს ვაშლს'


# სადაც გამოვიძახებთ / ცვლადის სახელს ყველგან გამოვა მისი მნიშცნელობა ანუ რასაც იმსახურებს ეს ცვლადი

# ცვლადი ინახავს მნიშნელობას
# country - ცვლადის სახელი, = - ხდება მნიშვნელობის მინიჭება , საქართველო - მნიშვნელობა
country = "საქართველო"



#  = დეკლარაცია
# ცვლადის სახელი, დეკლარაცია , ცვლადის ენიჭება მნიშვნელობა

country = "საქართველო"
# ბრჭყალების გარეშე რასაც დავწერ ყველაფერი მოისაზრება როგორც ცვლადის სახელი
country

print("---------------------------")
print(Box)


# დავითას თამაში
# ცვლადებში იწერება მნიშვნელოვანი ინფორმაცია
player = 14
speed = 0.5

# სტანდარტული ვერსია პითონის ცვლადების ჩაწერისას snake_case, camelCase --- js ში
# რა არ შეიძლება ცვლადის შექმნის დროს პირველი ასო უნდა იყოს პატარათი დაწერე p არა P არ ვიწტებთ ციფრებით. 1123 ციფრებით _შეიძლება
player_speed = "ასდას"
print(player-1)
print(speed+1.5)

